Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129EKCPDT.svd
        <register>
          <name>BOOTCFG</name>
          <description>Boot Configuration</description>
          <addressOffset>0x000011D0</addressOffset>
          <fields>
            <field>
              <name>FLASH_BOOTCFG_DBG0</name>
              <description>Debug Control 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_BOOTCFG_DBG1</name>
              <description>Debug Control 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_BOOTCFG_KEY</name>
              <description>KEY Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FLASH_BOOTCFG_EN</name>
              <description>Boot GPIO Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLASH_BOOTCFG_POL</name>
              <description>Boot GPIO Polarity</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FLASH_BOOTCFG_PIN</name>
              <description>Boot GPIO Pin</description>
              <bitRange>[12:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_0</name>
                  <description>Pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_1</name>
                  <description>Pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_2</name>
                  <description>Pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_3</name>
                  <description>Pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_4</name>
                  <description>Pin 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_5</name>
                  <description>Pin 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_6</name>
                  <description>Pin 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PIN_7</name>
                  <description>Pin 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_BOOTCFG_PORT</name>
              <description>Boot GPIO Port</description>
              <bitRange>[15:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_A</name>
                  <description>Port A</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_B</name>
                  <description>Port B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_C</name>
                  <description>Port C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_D</name>
                  <description>Port D</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_E</name>
                  <description>Port E</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_F</name>
                  <description>Port F</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_G</name>
                  <description>Port G</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_BOOTCFG_PORT_H</name>
                  <description>Port H</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_BOOTCFG_NW</name>
              <description>Not Written</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG0</name>
          <description>User Register 0</description>
          <addressOffset>0x000011E0</addressOffset>
          <fields>
            <field>
              <name>FLASH_USERREG0_DATA</name>
              <description>User Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG1</name>
          <description>User Register 1</description>
          <addressOffset>0x000011E4</addressOffset>
          <fields>
            <field>
              <name>FLASH_USERREG1_DATA</name>
              <description>User Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG2</name>
          <description>User Register 2</description>
          <addressOffset>0x000011E8</addressOffset>
          <fields>
            <field>
              <name>FLASH_USERREG2_DATA</name>
              <description>User Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USERREG3</name>
          <description>User Register 3</description>
          <addressOffset>0x000011EC</addressOffset>
          <fields>
            <field>
              <name>FLASH_USERREG3_DATA</name>
              <description>User Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE0</name>
          <description>Flash Memory Protection Read Enable 0</description>
          <addressOffset>0x00001200</addressOffset>
        </register>
        <register>
          <name>FMPRE1</name>
          <description>Flash Memory Protection Read Enable 1</description>
          <addressOffset>0x00001204</addressOffset>
        </register>
        <register>
          <name>FMPRE2</name>
          <description>Flash Memory Protection Read Enable 2</description>
          <addressOffset>0x00001208</addressOffset>
        </register>
        <register>
          <name>FMPRE3</name>
          <description>Flash Memory Protection Read Enable 3</description>
          <addressOffset>0x0000120C</addressOffset>
        </register>
        <register>
          <name>FMPRE4</name>
          <description>Flash Memory Protection Read Enable 4</description>
          <addressOffset>0x00001210</addressOffset>
        </register>
        <register>
          <name>FMPRE5</name>
          <description>Flash Memory Protection Read Enable 5</description>
          <addressOffset>0x00001214</addressOffset>
        </register>
        <register>
          <name>FMPRE6</name>
          <description>Flash Memory Protection Read Enable 6</description>
          <addressOffset>0x00001218</addressOffset>
        </register>
        <register>
          <name>FMPRE7</name>
          <description>Flash Memory Protection Read Enable 7</description>
          <addressOffset>0x0000121C</addressOffset>
        </register>
        <register>
          <name>FMPPE0</name>
          <description>Flash Memory Protection Program Enable 0</description>
          <addressOffset>0x00001400</addressOffset>
        </register>
        <register>
          <name>FMPPE1</name>
          <description>Flash Memory Protection Program Enable 1</description>
          <addressOffset>0x00001404</addressOffset>
        </register>
        <register>
          <name>FMPPE2</name>
          <description>Flash Memory Protection Program Enable 2</description>
          <addressOffset>0x00001408</addressOffset>
        </register>
        <register>
          <name>FMPPE3</name>
          <description>Flash Memory Protection Program Enable 3</description>
          <addressOffset>0x0000140C</addressOffset>
        </register>
        <register>
          <name>FMPPE4</name>
          <description>Flash Memory Protection Program Enable 4</description>
          <addressOffset>0x00001410</addressOffset>
        </register>
        <register>
          <name>FMPPE5</name>
          <description>Flash Memory Protection Program Enable 5</description>
          <addressOffset>0x00001414</addressOffset>
        </register>
        <register>
          <name>FMPPE6</name>
          <description>Flash Memory Protection Program Enable 6</description>
          <addressOffset>0x00001418</addressOffset>
        </register>
        <register>
          <name>FMPPE7</name>
          <description>Flash Memory Protection Program Enable 7</description>
          <addressOffset>0x0000141C</addressOffset>
        </register>
